
## Plan Result (aat)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.ccd_case_events_send_primary_connection_string
  * azurerm_servicebus_topic_authorization_rule.ccd_case_events_topic_send


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.ccd_case_events_send_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "ccd_case_events_send_primary_connection_string" {
      + content_type            = "terraform-managed"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
      + name                    = "ccd-case-events-sendonly-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "special-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sptribs-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
          + "source"              = "ccd-case-events sptribs-sendonly"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_servicebus_topic_authorization_rule.ccd_case_events_topic_send will be created
  + resource "azurerm_servicebus_topic_authorization_rule" "ccd_case_events_topic_send" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "sptribs-sendonly"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
      + topic_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-aat/topics/ccd-case-events-aat"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->